# make sure brew is up to date
brew update

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'

# Install Bash
brew 'bash'

# Install Binaries
brew 'git'
brew 'vcprompt'

# Databases
brew 'mongodb-community'

# Apps
cask 'alfred'
cask 'iterm2'
cask 'rectangle'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'mongodb-compass'
cask 'zoom'
cask 'postman'

# Fonts
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-code-mono-pl'
cask 'font-cascadia-code-mono'