# make sure brew is up to date
# brew update

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'
tap 'sass/sass'
tap 'dart-lang/dart'

# Install Bash
brew 'bash'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Install Binaries
brew 'git'
brew 'gh'
brew 'vcprompt'
brew 'mas'
brew 'trash'

# Install Python
brew 'python'
cask 'anaconda'

# Godot
cask 'godot'

# Install C/C++ Packages
brew 'cmake'

# Install Javascript Packages
brew 'yarn'
brew 'node'
brew 'nvm'
brew 'eslint'
brew 'sass/sass/sass'

# Databases
brew 'mongodb-community'
brew 'mysql'
brew 'postgresql'
brew 'sqlite'

# Apps
cask 'alfred'
cask 'iterm2'
cask 'rectangle'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'mongodb-compass'
cask 'zoom'
cask 'postman'
cask 'visual-studio-code'
cask 'visual-studio-code-insiders'
cask 'visual-studio'
cask 'unity'
cask 'mysqlworkbench'
cask 'steam'
cask 'love'
cask 'discord'

# Fonts
cask 'font-cascadia-code'
cask 'font-cascadia-mono'

# Install App Store Apps
mas '1Password', id: 1333542190
mas 'Xcode', id: 497799835
mas 'Microsoft Word', id: 462054704
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Excel', id: 462058435
mas 'Apple Configurator 2', id: 1037126344
mas 'Final Cut Pro', id: 424389933
mas 'Keynote', id: 409183694
mas 'iMovie', id: 408981434
mas 'iStatistica Pro', id: 1447778660
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
