# make sure brew is up to date
# brew update

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'mongodb/brew'
tap 'sass/sass'

# Install Bash
brew 'bash'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Install Binaries
brew 'git'
brew 'vcprompt'
brew 'mas'

# Install Programming Languages
brew 'python'

# Install C/C++ Packages
brew 'cmake'

# Install Javascript Packages
brew 'yarn'
brew 'node'
brew 'nvm'
brew 'eslint'
brew 'sass/sass/sass'

# Databases
brew 'mongodb-community'
brew 'mysql'
brew 'postgresql'
brew 'sqlite'

# Apps
cask 'alfred'
cask 'iterm2'
cask 'rectangle'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'mongodb-compass'
cask 'zoom'
cask 'postman'
cask 'visual-studio-code'
cask 'mysqlworkbench'
cask 'kite'

# Fonts
cask 'font-cascadia-code'
cask 'font-cascadia-code-pl'
cask 'font-cascadia-code-mono-pl'
cask 'font-cascadia-code-mono'

# Install App Store Apps
mas '1Password', id: 1333542190
mas 'Xcode', id: 497799835
mas 'Microsoft Word', id: 462054704
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Excel', id: 462058435